## Pandas

In [1]:
%pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp311-cp311-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.23.2 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.4.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\roaming\python\python311\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.3-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp311-cp311-win_amd64.whl (11.3 MB)
   ---------------------------------------- 0.0/11.3 MB ? eta -:--:--
   -- ------------------------------------- 0.6/11.3 MB 12.4 MB/s eta 0:00:01
   ------- -------------------------------- 2.1/11.3 MB 22.1 MB/s eta 0:00:01
   ------- -------------------------------- 2.1/11.3 MB 22.1 MB/s eta 0:00:01
   -------- ------------------------------- 2.5/11.3 MB 13.1 MB/s eta 0:00:01
   ------------- -------------------------- 4.0/11.3 MB 16.9 MB/s eta 0:00:01
   ------------------- -------------------- 5.4/11.3 MB 19.3 MB/s eta 0:00:01
   ------------------------ --------------- 6.9/11.3 MB 21.0 MB/s eta 0:00:01
   ----------------------------- ---------- 8.3/11.3 MB 22.0 MB/s eta 0:00:01
   ---------------------------------- ----- 9.9/11.3 MB 23.3 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.3 MB 25.1 MB/s eta 0:00:01
   ---------------------------------------- 11.3/11.3 MB 23.3 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
   ---------------------------------------- 0.0/509.2 kB ? eta -:--:--
   ---------------------------------------- 509.2/509.2 kB ? eta 0:00:00
Downloading tzdata-2025.3-py2.py3-none-any.whl (348 kB)
   ---------------------------------------- 0.0/348.5 kB ? eta -:--:--
   --------------------------------------- 348.5/348.5 kB 21.1 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.3 pytz-2025.2 tzdata-2025.3
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [7]:
import pandas as pd 
pd.__version__

'2.3.3'

In [ ]:
df = pd.read_csv("./data_0108/heroes.csv")

In [15]:
df

      이름  나이     직업     국적    키            재산
0   아이언맨  58    CEO     미국  174  1.150000e+10
1     토르  45      신  아스가르드  190           NaN
2  스파이더맨  18   고등학생     미국  177  6.000000e+02
3   원더우먼  27     공주  데미스키라  178           NaN
4     헐크  33  핵물리학자     미국  270  1.000000e+09
5   캡틴마블  25    파일럿     미국  170  3.400000e+08
6  블랙위도우  32    스파이    러시아  170  5.000000e+07

In [ ]:
# 포맷 바꾸는 메소드. 지수 형식의 수들을 원래대로 보여줌 
# 원본 데이터를 직접 바꾸는 것은 아님 
pd.options.display.float_format = '{:.0f}'.format

### 데이터 정보 확인하기

In [18]:
df.head(5)

      이름  나이     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
2  스파이더맨  18   고등학생     미국  177         600
3   원더우먼  27     공주  데미스키라  178         NaN
4     헐크  33  핵물리학자     미국  270  1000000000

In [19]:
df.sample()

     이름  나이   직업  국적    키        재산
5  캡틴마블  25  파일럿  미국  170 340000000

In [21]:
df.info()
# object = string

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   직업      7 non-null      object
 3   국적      7 non-null      object
 4   키       7 non-null      int64
 5   재산      5 non-null      float64
dtypes: float64(1), int64(2), object(3)
memory usage: 468.0+ bytes

In [22]:
df.describe()

       나이   키          재산
count   7   7           5
mean   34 190  2578000120
std    13  36  5003440739
min    18 170         600
25%    26 172    50000000
50%    32 177   340000000
75%    39 184  1000000000
max    58 270 11500000000

In [11]:
df.shape

(7, 6)

### 데이터 통계 살펴보기

In [26]:
# 컬럼에 유일한 값 확인하기 
df['국적'].unique()

array(['미국', '아스가르드', '데미스키라', '러시아'], dtype=object)

In [28]:
df['국적'].value_counts()

국적
미국       4
아스가르드    1
데미스키라    1
러시아      1
Name: count, dtype: int64

In [ ]:
# 상위 n개
df['나이'].nlargest() #n이 초기화 되어져 있음. n입력하지 않아도 됨.
df['나이'].nsmallest(2)

2    18
5    25
Name: 나이, dtype: int64

In [36]:
# 상위 n개
# 전체 레코드를 보려면 n개, 기준이 될 컬럼명 둘 다 입력해줘야 함
df.nlargest(5,'나이')

      이름  나이     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
4     헐크  33  핵물리학자     미국  270  1000000000
6  블랙위도우  32    스파이    러시아  170    50000000
3   원더우먼  27     공주  데미스키라  178         NaN

In [41]:
# 미션
# 키가 큰 순서대로 7명을 정렬
df.nlargest(7,'키')['이름']

4       헐크
1       토르
3     원더우먼
2    스파이더맨
0     아이언맨
5     캡틴마블
6    블랙위도우
Name: 이름, dtype: object

### 그룹화하기

In [141]:
df.groupby('국적')['나이'].mean()

국적
데미스키라   27
러시아     32
미국      34
아스가르드   45
Name: 나이, dtype: float64

### 데이터 인덱싱 및 슬라이싱

In [24]:
df['국적']

0       미국
1    아스가르드
2       미국
3    데미스키라
4       미국
5       미국
6      러시아
Name: 국적, dtype: object

In [ ]:
# 데이터 일부분 선택
df['이름']
type(df['이름']) # 1개의 컬럼 = 시리즈 = array

pandas.core.series.Series

In [45]:
# df['이름','직업']
df[['이름','직업']]

      이름     직업
0   아이언맨    CEO
1     토르      신
2  스파이더맨   고등학생
3   원더우먼     공주
4     헐크  핵물리학자
5   캡틴마블    파일럿
6  블랙위도우    스파이

In [ ]:
type(df[['이름','직업']]) # 2개 이상의 컬럼 = 데이터 프레임

pandas.core.frame.DataFrame

In [49]:
# 미션2
# 시리즈 데이터에서 일부 데이터 슬라이싱하기
# 7개 이름 중 아이언맨-헐크까지 슬라이싱하기
df['이름'][:5]

0     아이언맨
1       토르
2    스파이더맨
3     원더우먼
4       헐크
Name: 이름, dtype: object

In [ ]:
df[:3] # numpy처럼 슬라이싱하는 것도 가능함

      이름  나이    직업     국적    키          재산
0   아이언맨  58   CEO     미국  174 11500000000
1     토르  45     신  아스가르드  190         NaN
2  스파이더맨  18  고등학생     미국  177         600

In [54]:
df[5:]

      이름  나이   직업   국적    키        재산
5   캡틴마블  25  파일럿   미국  170 340000000
6  블랙위도우  32  스파이  러시아  170  50000000

In [ ]:
# df[4] #KeyError : df다음에 오는 대괄호 안에는 컬럼 이름만 와야함
# df[4, '이름'] #마찬가지로 에러
# Numpy와는 다른 부분
# 그래서 iloc, loc를 사용

# df.iloc[행번호, 열번호] : 행 탐색
df.iloc[:4,]

      이름  나이    직업     국적    키          재산
0   아이언맨  58   CEO     미국  174 11500000000
1     토르  45     신  아스가르드  190         NaN
2  스파이더맨  18  고등학생     미국  177         600
3   원더우먼  27    공주  데미스키라  178         NaN

In [63]:
df.iloc[:3, :3]

      이름  나이    직업
0   아이언맨  58   CEO
1     토르  45     신
2  스파이더맨  18  고등학생

In [62]:
df.iloc[[1,3,5]]

     이름  나이   직업     국적    키        재산
1    토르  45    신  아스가르드  190       NaN
3  원더우먼  27   공주  데미스키라  178       NaN
5  캡틴마블  25  파일럿     미국  170 340000000

In [ ]:
# df.loc['행이름','열이름']
df.loc[2] # 인덱스가 숫자인 경우에는 숫자를 자동으로 string으로 인식

이름    스파이더맨
나이       18
직업     고등학생
국적       미국
키       177
재산      600
Name: 2, dtype: object

In [66]:
df.loc[3,'이름']

'원더우먼'

In [ ]:
# 미션
# loc를 이용해서 이름,직업 열 + 0-2 행 추출해보기
df.loc[:2,['이름','직업']] 

#행은 인덱스 번호, 끝번 포함
#열은 이름으로, 여러 개 열이므로 리스트로 묶기

      이름    직업
0   아이언맨   CEO
1     토르     신
2  스파이더맨  고등학생

In [70]:
df.loc[:2, '이름':'직업'] #연속된 열 추출할 시에는 : 사용

      이름  나이    직업
0   아이언맨  58   CEO
1     토르  45     신
2  스파이더맨  18  고등학생

조건에 따라 인덱싱/슬라이싱

In [75]:
# 나이가 30살 이상인 레코드만 추출하기
# df['나이'] >= 30 #boolean indexing으로 T/F 시리즈 나옴
df.loc[ df['나이'] >= 30 ]

      이름  나이     직업     국적    키          재산
0   아이언맨  58    CEO     미국  174 11500000000
1     토르  45      신  아스가르드  190         NaN
4     헐크  33  핵물리학자     미국  270  1000000000
6  블랙위도우  32    스파이    러시아  170    50000000

In [77]:
df.loc[ df['직업']=='스파이' , ['이름','국적'] ]

      이름   국적
6  블랙위도우  러시아

In [89]:
# 미션 
# 나이가 30초과, 50미만인 레코드만 추출
df[ (df['나이'] > 30 ) & (df['나이'] < 50 ) ]
df.loc[ (df['나이'] > 30 ) & (df['나이'] < 50 ) ]

      이름  나이     직업     국적    키         재산
1     토르  45      신  아스가르드  190        NaN
4     헐크  33  핵물리학자     미국  270 1000000000
6  블랙위도우  32    스파이    러시아  170   50000000

In [95]:
# 미션
# 키가 180 이상인 레코드의 이름과 나이 컬럼만 출력
df.loc[ df['키'] >= 180 , ['이름', '나이'] ]
df[df['키'] >= 180][['이름', '나이'] ]

   이름  나이
1  토르  45
4  헐크  33

### 데이터 변경하기

In [96]:
df1 = df.copy()

In [ ]:
# 컬럼 전체에 새로운 값 할당 
# 개수를 맞춰줘야 함
df1['국적'] = ['대한민국', '미국', '스리랑카', '중국', '일본', '대한민국', '대한민국']
df1

      이름  나이     직업    국적    키          재산
0   아이언맨  58    CEO  대한민국  174 11500000000
1     토르  45      신    미국  190         NaN
2  스파이더맨  18   고등학생  스리랑카  177         600
3   원더우먼  27     공주    중국  178         NaN
4     헐크  33  핵물리학자    일본  270  1000000000
5   캡틴마블  25    파일럿  대한민국  170   340000000
6  블랙위도우  32    스파이  대한민국  170    50000000

In [ ]:
# 컬럼 생성
df2 = df.copy()
df2['전투력']=[90, 90, 95, 65, 78, 99, 40]
df2

      이름  나이     직업     국적    키          재산  전투력
0   아이언맨  58    CEO     미국  174 11500000000   90
1     토르  45      신  아스가르드  190         NaN   90
2  스파이더맨  18   고등학생     미국  177         600   95
3   원더우먼  27     공주  데미스키라  178         NaN   65
4     헐크  33  핵물리학자     미국  270  1000000000   78
5   캡틴마블  25    파일럿     미국  170   340000000   99
6  블랙위도우  32    스파이    러시아  170    50000000   40

In [100]:
# 일괄적으로 값 변경
df2['전투력'] = df2['전투력'] -10
df2

      이름  나이     직업     국적    키          재산  전투력
0   아이언맨  58    CEO     미국  174 11500000000   80
1     토르  45      신  아스가르드  190         NaN   80
2  스파이더맨  18   고등학생     미국  177         600   85
3   원더우먼  27     공주  데미스키라  178         NaN   55
4     헐크  33  핵물리학자     미국  270  1000000000   68
5   캡틴마블  25    파일럿     미국  170   340000000   89
6  블랙위도우  32    스파이    러시아  170    50000000   30

컬럼 변경하기

In [ ]:
# 컬럼 이름 직접 변경
df3 = df.copy()
df3.columns = ['name', 'age', 'job', 'nation', 'height', 'money']
df3.head(3)

    name  age   job nation  height       money
0   아이언맨   58   CEO     미국     174 11500000000
1     토르   45     신  아스가르드     190         NaN
2  스파이더맨   18  고등학생     미국     177         600

In [ ]:
# 특정 컬럼 이름만 변경하기
# 덮어써주지 않으면 적용 안 됨! 
df3.rename( columns = { 'name' : '이름', 'age':'나이'}).head(1)

     이름  나이  job nation  height       money
0  아이언맨  58  CEO     미국     174 11500000000

In [109]:
df3.head(1)

   name  age  job nation  height       money
0  아이언맨   58  CEO     미국     174 11500000000

In [ ]:
# 적용하는 방법1 : 변수에 다시 할당
df3 = df3.rename( columns = { 'name' : '이름', 'age':'나이'}).head(1)
df3.head(1)

     이름  나이  job nation  height       money
0  아이언맨  58  CEO     미국     174 11500000000

In [113]:
# 적용하는 방법2 : inplace=True 옵션 주기
df3.rename( columns = { '이름' : 'name', '나이':'age'}, inplace=True )
df3.head(1)

   name  age  job nation  height       money
0  아이언맨   58  CEO     미국     174 11500000000

컬럼값 일괄 변경(단위 수정)

In [131]:
df.columns

Index(['이름', '나이', '직업', '국적', '키', '재산'], dtype='object')

In [143]:
def add_cm(height):
    return str(height) +'cm'     #height이 int이므로 str로 변경

df['키'].apply(add_cm)

0    174cm
1    190cm
2    177cm
3    178cm
4    270cm
5    170cm
6    170cm
Name: 키, dtype: object

컬럼 삭제하기

In [116]:
# 이것도 마찬가지로 원본에 적용하기 위해서는
# 1.변수에 저장  2. inplace=True
df2.drop(columns=['전투력'], inplace=True)
df2.head(1)

     이름  나이   직업  국적    키          재산
0  아이언맨  58  CEO  미국  174 11500000000

### 결측치 처리하기

In [ ]:
# 결측치 확인하기
df[df['재산'].isnull()]

     이름  나이  직업     국적    키  재산
1    토르  45   신  아스가르드  190 NaN
3  원더우먼  27  공주  데미스키라  178 NaN

In [ ]:
df.isnull().sum()   # 재산에 2개의 결측치

이름    0
나이    0
직업    0
국적    0
키     0
재산    2
dtype: int64

In [ ]:
df.info()  # 재산에 2개의 결측치

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   직업      7 non-null      object
 3   국적      7 non-null      object
 4   키       7 non-null      int64
 5   재산      5 non-null      float64
dtypes: float64(1), int64(2), object(3)
memory usage: 468.0+ bytes

In [121]:
# 결측치 있는 행을 지움
df5 = df.copy()
df5.dropna()

      이름  나이     직업   국적    키          재산
0   아이언맨  58    CEO   미국  174 11500000000
2  스파이더맨  18   고등학생   미국  177         600
4     헐크  33  핵물리학자   미국  270  1000000000
5   캡틴마블  25    파일럿   미국  170   340000000
6  블랙위도우  32    스파이  러시아  170    50000000

In [ ]:
# 0으로 채우기
df['재산'].fillna(0)

0   11500000000
1             0
2           600
3             0
4    1000000000
5     340000000
6      50000000
Name: 재산, dtype: float64

In [125]:
# 평균값으로 대치하기
df['재산'].fillna(df['재산'].mean())

0   11500000000
1    2578000120
2           600
3    2578000120
4    1000000000
5     340000000
6      50000000
Name: 재산, dtype: float64

시계열/ 날짜 / 온도 같이 순차적 변화+상황이 크게 변하지 않는 데이터의 경우  
-> 이전값 대치 / 이후값 대치

In [128]:
# 이전값으로 대치하기
df['재산'].ffill()
df['재산'].fillna(method='ffill') # deprecated될 예정

C:\Users\USER\AppData\Local\Temp\ipykernel_10316\1792828262.py:3: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['재산'].fillna(method='ffill') # deprecated될 예정

0   11500000000
1   11500000000
2           600
3           600
4    1000000000
5     340000000
6      50000000
Name: 재산, dtype: float64

### 미션

In [186]:
# sales, user 데이터프레임으로 불러오기
sales = pd.read_csv(r'.\data_0108\sales_data.csv')
user = pd.read_csv(r'.\data_0108\user_data.csv')

In [187]:
sales.head(1)

  customer_id  order_date product_category   amount channel  discount_rate
0        C001  2025-09-01               가전  1200000     온라인              0

In [213]:
pd.options.display.float_format = '{:.2f}'.format
sales.head(1)

   고객ID        구매일자 제품분류     구매금액 구매채널  할인율
0  C001  2025-09-01   가전  1200000  온라인 0.10

In [214]:
user.head(1)

   고객ID  고객명 가입지역
0  C001  김민준   서울

In [215]:
# 컬럼명을 한글로 변경
# sales : '고객ID', '구매일자', '제품분류', '구매금액', '구매채널', '할인율'
sales.columns = ['고객ID', '구매일자', '제품분류', '구매금액', '구매채널', '할인율']
sales.head(1)

   고객ID        구매일자 제품분류     구매금액 구매채널  할인율
0  C001  2025-09-01   가전  1200000  온라인 0.10

In [216]:
# 컬럼명을 한글로 변경
# user : '고객ID', '고객명', '가입지역'
user.columns = ['고객ID', '고객명', '가입지역']
user.head(1)

   고객ID  고객명 가입지역
0  C001  김민준   서울

In [217]:
# 구매금액이 10000원 이상인 데이터만 필터링 #sales
sales[ sales['구매금액'] >= 10000]

   고객ID        구매일자  제품분류     구매금액  구매채널  할인율
0  C001  2025-09-01    가전  1200000   온라인 0.10
1  C002  2025-09-01  주방용품    45000  오프라인 0.05
2  C003  2025-09-02   식료품    12000   온라인  NaN
3  C001  2025-09-02    의류    89000   온라인 0.15
4  C004  2025-09-03  주방용품    21000   온라인 0.00
5  C002  2025-09-03    가전  2500000  오프라인 0.05
7  C003  2025-09-04  주방용품    62000  오프라인  NaN
9  C004  2025-09-05    의류   150000   온라인 0.20

In [218]:
# '온라인' 채널에서 발생한 구매 중 5000원 이상인 것만 필터링 #sales
sales[ (sales['구매채널']=='온라인') & (sales['구매금액'] >=5000) ]

   고객ID        구매일자  제품분류     구매금액 구매채널  할인율
0  C001  2025-09-01    가전  1200000  온라인 0.10
2  C003  2025-09-02   식료품    12000  온라인  NaN
3  C001  2025-09-02    의류    89000  온라인 0.15
4  C004  2025-09-03  주방용품    21000  온라인 0.00
6  C005  2025-09-04    도서     9900  온라인 0.00
8  C001  2025-09-05   식료품     8500  온라인 0.00
9  C004  2025-09-05    의류   150000  온라인 0.20

In [219]:
# '가전', '주방용품' 에 속하는 데이터만 필터링
sales[ sales['제품분류'] == '주방용품' ]

   고객ID        구매일자  제품분류   구매금액  구매채널  할인율
1  C002  2025-09-01  주방용품  45000  오프라인 0.05
4  C004  2025-09-03  주방용품  21000   온라인 0.00
7  C003  2025-09-04  주방용품  62000  오프라인  NaN

In [220]:
# 각 열별 결측치 개수 확인
sales.isnull().sum()

고객ID    0
구매일자    0
제품분류    0
구매금액    0
구매채널    0
할인율     2
dtype: int64

In [221]:
# 결측치가 있는 행 전체 삭제
sales_dropna = sales.copy()
# sales_dropna['할인율'].dropna(inplace=True) #시리즈에 적용하면 시리즈 복사본에 적용이 되므로 삭제 안 됨
sales_dropna.dropna(inplace=True)
# sales_dropna.dropna(subset=['할인율'], inplace=True)
sales_dropna.isnull().sum()

고객ID    0
구매일자    0
제품분류    0
구매금액    0
구매채널    0
할인율     0
dtype: int64

In [223]:
# 특정 값으로 결측치 채우기
sales_fill = sales.copy()
# sales_fill['할인율'].fillna( sales['할인율'].mean(), inplace=True )
# 이 방법은 deprecated 경고가 나오므로 직접 할당 사용하기
sales_fill['할인율'] = sales_fill['할인율'].fillna( sales_fill['할인율'].mean())
sales_fill.isnull().sum()

고객ID    0
구매일자    0
제품분류    0
구매금액    0
구매채널    0
할인율     0
dtype: int64

In [228]:
# 할인률이 적용된 df['실구매금액'] 새롭게 생성
sales['실구매금액'] = sales['구매금액'] * sales['할인율']
sales.head()

   고객ID        구매일자  제품분류     구매금액  구매채널  할인율     실구매금액
0  C001  2025-09-01    가전  1200000   온라인 0.10 120000.00
1  C002  2025-09-01  주방용품    45000  오프라인 0.05   2250.00
2  C003  2025-09-02   식료품    12000   온라인  NaN       NaN
3  C001  2025-09-02    의류    89000   온라인 0.15  13350.00
4  C004  2025-09-03  주방용품    21000   온라인 0.00      0.00

In [242]:
# 고객 등급을 'VIP'와 '일반'으로 나누기(구매금액이 10000 이상이면 VIP)
sales_level = sales.copy()
sales_level['고객등급'] = sales_level['구매금액'].apply(lambda x: 'VIP' if x>=10000 else '일반')
sales_level.head(3)

   고객ID        구매일자  제품분류     구매금액  구매채널  할인율     실구매금액 고객등급
0  C001  2025-09-01    가전  1200000   온라인 0.10 120000.00  VIP
1  C002  2025-09-01  주방용품    45000  오프라인 0.05   2250.00  VIP
2  C003  2025-09-02   식료품    12000   온라인  NaN       NaN  VIP

In [231]:
# 제품분류별 구매금액의 평균 구하기
sales.groupby('제품분류')['구매금액'].mean()

제품분류
가전     1850000.00
도서        9900.00
식료품      10250.00
의류      119500.00
주방용품     42666.67
Name: 구매금액, dtype: float64

In [236]:
# 구매채널별로 그룹화하여, 구매금액의 총합과 평균 동시 구하기
print('평균\n', sales.groupby('구매채널')['구매금액'].mean())
print('총합\n', sales.groupby('구매채널')['구매금액'].sum())

평균
 구매채널
오프라인   869000.00
온라인    212914.29
Name: 구매금액, dtype: float64
총합
 구매채널
오프라인    2607000
온라인     1490400
Name: 구매금액, dtype: int64

## Matplotlib